nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe247/demo_apps/bubble_peripheral/pin_mux.c
/* 
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MCXE247
package_id: MCXE247VLQ
mcu_data: ksdk2_0
processor_version: 0.0.0
board: FRDM-MCXE247
pin_labels:
- {pin_num: '55', pin_signal: PTD8/LPI2C1_SDA/MII_RXD3/FTM2_FLT2/FXIO_D1/FTM1_CH4/QSPI_B_IO5, label: I2C1_SDA, identifier: I2C1_SDA}
- {pin_num: '54', pin_signal: PTD9/LPI2C1_SCL/FXIO_D0/FTM2_FLT3/MII_RXD2/FTM1_CH5/QSPI_B_IO4, label: I2C1_SCL, identifier: I2C1_SCL}
- {pin_num: '63', pin_signal: PTB3/FTM1_CH1/LPSPI0_SIN/FTM1_QD_PHA/TRGMUX_IN2/ADC0_SE7, label: SIN, identifier: SIN;LPSPI0_SIN}
- {pin_num: '122', pin_signal: PTE2/LPSPI0_SOUT/LPTMR0_ALT3/FTM3_CH6/LPUART1_CTS/SAI1_SYNC/ADC1_SE10, label: LPSPI0_SIN, identifier: LPSPI0_SIN;LPSPI0_SOUT}
- {pin_num: '138', pin_signal: PTE0/LPSPI0_SCK/TCLK1/LPI2C1_SDA/LPSPI1_SOUT/FTM1_FLT2/SAI0_D2, label: LPSPI0_SCK, identifier: LPSPI0_SCK}
- {pin_num: '121', pin_signal: PTE6/LPSPI0_PCS2/FTM7_FLT1/FTM3_CH7/LPUART1_RTS/ADC1_SE11, label: LPSPI0_PCS2, identifier: LPSPI0_PCS2}
- {pin_num: '143', pin_signal: PTA9/LPUART2_TX/LPSPI2_PCS0/FXIO_D7/FTM3_FLT2/FTM1_FLT3/FTM4_FLT0, label: SW2}
- {pin_num: '42', pin_signal: PTC3/FTM0_CH3/CAN0_TX/LPUART0_TX/MII_TX_ER/QSPI_A_CS/QSPI_B_IO3/ADC0_SE11/CMP0_IN4, label: PTC3_PIN42, identifier: PTC3_PIN42}
- {pin_num: '75', pin_signal: PTC10/FTM3_CH4/TRGMUX_IN11, label: SW3}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
    BOARD_InitPWMLEDsPins();
    BOARD_Init_I2C_GPIO_pins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '25', peripheral: LPUART2, signal: RX, pin_signal: PTD17/FTM0_FLT2/LPUART2_RX/FTM5_FLT1}
  - {pin_num: '23', peripheral: LPUART2, signal: TX, pin_signal: PTE12/FTM0_FLT3/LPUART2_TX/FTM5_FLT0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTD17 (pin 25) is configured as LPUART2_RX */
    PORT_SetPinMux(BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PORT, BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN, kPORT_MuxAlt3);

    /* PORTE12 (pin 23) is configured as LPUART2_TX */
    PORT_SetPinMux(BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PORT, BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN, kPORT_MuxAlt3);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitACCELPins:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '105', peripheral: LPI2C0, signal: SDA, pin_signal: PTA2/FTM3_CH0/LPI2C0_SDA/EWM_OUT_b/FXIO_D4/LPUART0_RX/ADC1_SE0, drive_strength: low, pull_select: up,
    pull_enable: enable, passive_filter: disable, digital_filter: disable}
  - {pin_num: '104', peripheral: LPI2C0, signal: SCL, pin_signal: PTA3/FTM3_CH1/LPI2C0_SCL/EWM_IN/FXIO_D5/LPUART0_TX/ADC1_SE1, drive_strength: low, pull_select: up,
    pull_enable: enable, passive_filter: disable, digital_filter: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitACCELPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitACCELPins(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Configure digital filter */
    PORT_EnablePinsDigitalFilter(
        /* Digital filter is configured on port A */
        PORTA,
        /* Digital filter is configured for PORTA0 */
          PORT_DFER_DFE_2_MASK
            /* Digital filter is configured for PORTA1 */
            | PORT_DFER_DFE_3_MASK,
        /* Disable digital filter */
        false);

    const port_pin_config_t SENSOR_I2C0_SDA = {/* Internal pull-up resistor is enabled */
                                               kPORT_PullUp,
                                               /* Passive filter is disabled */
                                               kPORT_PassiveFilterDisable,
                                               /* Low drive strength is configured */
                                               kPORT_LowDriveStrength,
                                               /* Pin is configured as LPI2C0_SDA */
                                               kPORT_MuxAlt3,
                                               /* Pin Control Register fields [15:0] are not locked */
                                               kPORT_UnlockRegister};
    /* PORTA2 (pin 105) is configured as LPI2C0_SDA */
    PORT_SetPinConfig(BOARD_INITACCELPINS_SENSOR_I2C0_SDA_PORT, BOARD_INITACCELPINS_SENSOR_I2C0_SDA_PIN, &SENSOR_I2C0_SDA);

    const port_pin_config_t SENSOR_I2C0_SCL = {/* Internal pull-up resistor is enabled */
                                               kPORT_PullUp,
                                               /* Passive filter is disabled */
                                               kPORT_PassiveFilterDisable,
                                               /* Low drive strength is configured */
                                               kPORT_LowDriveStrength,
                                               /* Pin is configured as LPI2C0_SCL */
                                               kPORT_MuxAlt3,
                                               /* Pin Control Register fields [15:0] are not locked */
                                               kPORT_UnlockRegister};
    /* PORTA3 (pin 104) is configured as LPI2C0_SCL */
    PORT_SetPinConfig(BOARD_INITACCELPINS_SENSOR_I2C0_SCL_PORT, BOARD_INITACCELPINS_SENSOR_I2C0_SCL_PIN, &SENSOR_I2C0_SCL);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPWMLEDsPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '70', peripheral: FTM3, signal: 'CH, 7', pin_signal: PTC13/FTM3_CH7/FTM2_CH7/LPUART2_RTS}
  - {pin_num: '107', peripheral: FTM3, signal: 'CH, 3', pin_signal: PTB11/FTM3_CH3/LPI2C0_HREQ}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPWMLEDsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPWMLEDsPins(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortC);

    /* PORTB11 (pin 107) is configured as FTM3_CH3 */
    PORT_SetPinMux(BOARD_INITPWMLEDSPINS_LED_GREEN_PORT, BOARD_INITPWMLEDSPINS_LED_GREEN_PIN, kPORT_MuxAlt2);

    /* PORTC13 (pin 70) is configured as FTM3_CH7 */
    PORT_SetPinMux(BOARD_INITPWMLEDSPINS_LED_RED_PORT, BOARD_INITPWMLEDSPINS_LED_RED_PIN, kPORT_MuxAlt2);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_Init_I2C_GPIO_pins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '104', peripheral: GPIOA, signal: 'GPIO, 3', pin_signal: PTA3/FTM3_CH1/LPI2C0_SCL/EWM_IN/FXIO_D5/LPUART0_TX/ADC1_SE1, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '105', peripheral: GPIOA, signal: 'GPIO, 2', pin_signal: PTA2/FTM3_CH0/LPI2C0_SDA/EWM_OUT_b/FXIO_D4/LPUART0_RX/ADC1_SE0, direction: OUTPUT, gpio_init_state: 'true'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_Init_I2C_GPIO_pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_Init_I2C_GPIO_pins(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortA);

    gpio_pin_config_t SENSOR_I2C0_SDA_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTA2 (pin 105)  */
    GPIO_PinInit(BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SDA_GPIO, BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SDA_PIN, &SENSOR_I2C0_SDA_config);

    gpio_pin_config_t SENSOR_I2C0_SCL_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTA3 (pin 104)  */
    GPIO_PinInit(BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SCL_GPIO, BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SCL_PIN, &SENSOR_I2C0_SCL_config);

    /* PORTA2 (pin 105) is configured as PTA2 */
    PORT_SetPinMux(BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SDA_PORT, BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SDA_PIN, kPORT_MuxAsGpio);

    /* PORTA3 (pin 104) is configured as PTA3 */
    PORT_SetPinMux(BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SCL_PORT, BOARD_INIT_I2C_GPIO_PINS_SENSOR_I2C0_SCL_PIN, kPORT_MuxAsGpio);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
